zibolux/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
	debug_printf("cbSetCfg:\r\n");
	debug_printf(" type: %d\r\n", req.type);
	debug_printf(" len: %d\r\n", req.data_length);
	debug_printf(" name: %s\r\n", req.name);

	if (req.type == 0) // TYPE_INT32 (0)
	{
		int32_t int32_val = (req.data[0]) + (req.data[1] << 8) + (req.data[2] << 16) + (req.data[3] << 24);
		debug_printf("(int32) data: %d\r\n", int32_val);
	}
	if (req.type == 1) // TYPE_UINT32 (1)
	{
		uint32_t uint32_val = (req.data[0]) + (req.data[1] << 8) + (req.data[2] << 16) + (req.data[3] << 24);
		debug_printf("(uint32) data: %d\r\n", uint32_val);
	}
	if (req.type == 2) // TYPE_FLOAT (2)
	{
		for (i = 0; i < 4; i++)
		{
			float_val.b[i] = req.data[i];
		}
		debug_printf("(float) data: %f\r\n", float_val.f);
	}
	if (req.type == 3) // TYPE_DOUBLE (3)
	{
		for (i = 0; i < 8; i++)
		{
			double_val.b[i] = req.data[i];
		}
		debug_printf("(double) data: %Lf\r\n", double_val.d);
	}
	if (req.type == 4) // TYPE_STRING (4)
	{
		debug_printf("(string) data: '");
		for (i = 0; i < req.data_length; i++)
		{
			debug_printf("%c", req.data[i]);
		}
		debug_printf("'\r\n");
	}
	if (req.type == 5) // TYPE_BARRAY (5)
	{
		debug_printf("(byte array) data: '");
		for (i = 0; i < req.data_length; i++)
		{
			debug_printf("0x%02x ", req.data[i]);
		}
		debug_printf("'\r\n");
	}

	// debug print data[] array
	for (i = 0; i < req.data_length; i++)
	{
		debug_printf(" data[%d]: %d\r\n", i, req.data[i]);
	}

	SPIFLASH_WriteCfgValue(req.name, req.type, req.data_length, req.data);
	res.status = 1;
}

/*
 *  callback for mowgli/EnableMowerMotor Service
 */
void cbEnableMowerMotor(const mower_msgs::MowerControlSrvRequest &req, mower_msgs::MowerControlSrvResponse &res)
{
	if (req.mow_enabled && !Emergency_State()) {
        blade_on_off = 1;
    } else {
        blade_on_off = 0;
    }
}

/*
 * callback for set emergency state by remote
 */
void cbSetEmergency(const mower_msgs::EmergencyStopSrvRequest &req, mower_msgs::EmergencyStopSrvResponse &res)
{
	Emergency_SetState(req.emergency);

}

/*
 *  callback for mowgli/Reboot Service
 */
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res)
{
	// debug_printf("cbReboot:\r\n");
	reboot_flag = true;
}

/*
 * ROS housekeeping
 */
extern "C" void spinOnce()
{
	if (NBT_handler(&ros_nbt))
	{
		nh.spinOnce();
#if OPTION_BUMPER == 1
		bumper_left_msg.header.stamp = nh.now();
		bumper_left_msg.header.frame_id = "bumper_left_link";
		bumper_right_msg.header.stamp = nh.now();
		bumper_right_msg.header.frame_id = "bumper_right_link";

		bumper_left_msg.radiation_type = 0;
		bumper_left_msg.field_of_view = 1.64; /* 90°*/
		bumper_left_msg.min_range = 0.0;
		bumper_left_msg.max_range = 0.20;
		bumper_left_msg.range = HALLSTOP_Left_Sense() * 0.05;

		bumper_right_msg.radiation_type = 0;
		bumper_right_msg.field_of_view = 1.64; /* 90°*/
		bumper_right_msg.min_range = 0.0;
		bumper_right_msg.max_range = 0.20;
		bumper_right_msg.range = HALLSTOP_Right_Sense() * 0.05;

		pubLeftBumper.publish(&bumper_left_msg);
		pubRightBumper.publish(&bumper_right_msg);
#endif
	}
}

/*
 *  Initialize rosserial
 */
extern "C" void init_ROS()
{
	ringbuffer_init(&rb, RxBuffer, RxBufferSize);

	// Initialize ROS
	nh.initNode();
	/*set max time to 10ms to give some time to the other functions*/
	// nh.setSpinTimeout(10);
#if OPTION_ULTRASONIC == 1
	nh.advertise(pubLeftUltrasonic);
	nh.advertise(pubRightUltrasonic);
#endif
#if OPTION_BUMPER == 1
	nh.advertise(pubLeftBumper);
	nh.advertise(pubRightBumper);
#endif

	nh.advertise(pubButtonState);
	nh.advertise(pubIMU);
#ifdef ROS_PUBLISH_MOWGLI
	nh.advertise(pubStatus);
#endif
	nh.advertise(pubOMStatus);
	nh.advertise(pubWheelTicks);

	// Initialize Subscribers
	nh.subscribe(subCommandVelocity);
	nh.subscribe(subCommandHighLevelStatus);

	// Initialize Services
	//nh.advertiseService(svcSetCfg);
	//nh.advertiseService(svcGetCfg);
	nh.advertiseService(svcEnableMowerMotor);
	nh.advertiseService(svcSetEmergency);
	nh.advertiseService(svcReboot);
	nh.serviceClient(svcHighLevelControl);

	// Initialize Timers
	NBT_init(&publish_nbt, 1000);
	NBT_init(&panel_nbt, 100);
	NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
	NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
	NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
	NBT_init(&ros_nbt, 10);
}

float clamp(float d, float min, float max) {
  const float t = d < min ? min : d;
  return t > max ? max : t;
}
